read_verilog rtl/*.v
hierarchy -check -top top
proc
opt
fsm
opt
memory
opt
techmap
opt
read_liberty -lib /usr/local/share/pdk/sky130A/libs.ref/sky130_fd_sc_hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
abc -liberty /usr/local/share/pdk/sky130A/libs.ref/sky130_fd_sc_hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
flatten
clean
stat
write_verilog synth/top_gate.v